import React from "react";
import { Svg } from "@soy-libs/uikit";
import { SvgProps } from "./types";

const Icon: React.FC<SvgProps> = (props) => {
  return (
    <Svg  width="77.511" height="71.956"  viewBox="0 0 77.511 71.956" {...props}>
      <g id="Сгруппировать_1474" data-name="Сгруппировать 1474" transform="translate(-666.11 -3440)">
        <g id="Сгруппировать_1467" data-name="Сгруппировать 1467">
          <path id="Контур_1361" data-name="Контур 1361" d="M638.312,811.949l-5.078-2.916-1.369,2.361c2.148,1.236,4.185,2.577,6.372,3.587a3.706,3.706,0,0,0,3.342-.189l5.89-3.4-1.353-2.36-5.04,2.893c-.022-.391-.051-.667-.052-.942,0-2.7.008-5.392,0-8.088a13.2,13.2,0,0,0-13.193-13.247c-3.138-.021-6.276,0-9.489,0v2.689c.279.017,6.343.076,9.036,0a10.613,10.613,0,0,1,10.953,11.076C638.235,806.187,638.312,808.972,638.312,811.949Z" transform="translate(86.693 2650.932)" fill={props.color}/>
          <path id="Контур_1362" data-name="Контур 1362" d="M637.271,838.667v-4.079l-5.2,7.124,1.252,3.927Z" transform="translate(84.318 2643.153)" fill={props.color}/>
          <path id="Контур_1363" data-name="Контур 1363" d="M630.925,846.258l-1.7,7.762,2.67-4.711Z" transform="translate(84.81 2641.134)" fill={props.color}/>
          <path id="Контур_1364" data-name="Контур 1364" d="M636.876,856.787h2.964l2.59-8.168-4.083-7.179-4.06,7.179Z" transform="translate(83.935 2641.968)" fill={props.color}/>
          <path id="Контур_1365" data-name="Контур 1365" d="M630.143,861.669l6.248,3.917-1.237-3.917Z" transform="translate(84.651 2638.468)" fill={props.color}/>
          <path id="Контур_1366" data-name="Контур 1366" d="M645.234,841.711l-5.2-7.124v4.08l3.951,6.993Z" transform="translate(82.94 2643.153)" fill={props.color}/>
          <path id="Контур_1367" data-name="Контур 1367" d="M632.385,852.12l-3.706,6.539h5.776Z" transform="translate(84.904 2640.12)" fill={props.color}/>
          <path id="Контур_1368" data-name="Контур 1368" d="M645.934,849.279l2.67,4.711-1.7-7.762Z" transform="translate(81.919 2641.139)" fill={props.color}/>
          <path id="Контур_1369" data-name="Контур 1369" d="M635.006,824.829a21.143,21.143,0,1,0,21.149,21.117A21.15,21.15,0,0,0,635.006,824.829Zm10.373,29.936a.312.312,0,0,1-.084.2.665.665,0,0,1-.2.22l-.079.035-9.824,6.163a.775.775,0,0,1-.376.1.693.693,0,0,1-.381-.107l-9.9-6.195a.647.647,0,0,1-.251-.3l-.011-.065a.169.169,0,0,1-.024-.1v-.218l3.224-14.759a.689.689,0,0,1,.152-.294l6.635-9.076a.715.715,0,0,1,1.1-.007l6.66,9.107a.616.616,0,0,1,.126.25l3.229,14.774A.479.479,0,0,1,645.379,854.765Z" transform="translate(87.466 2644.842)" fill={props.color}/>
          <path id="Контур_1370" data-name="Контур 1370" d="M642.726,858.63H648.5l-3.706-6.539Z" transform="translate(82.474 2640.125)" fill={props.color}/>
          <path id="Контур_1371" data-name="Контур 1371" d="M640.692,865.586l6.247-3.917h-5.011Z" transform="translate(82.826 2638.468)" fill={props.color}/>
          <path id="Контур_1372" data-name="Контур 1372" d="M638.982,864.919l1.046-3.25h-2.072Z" transform="translate(83.3 2638.468)" fill={props.color}/>
          <path id="Контур_1373" data-name="Контур 1373" d="M592.444,788.95a21.141,21.141,0,1,0,21.1,21.188A21.149,21.149,0,0,0,592.444,788.95Zm-.388,7.118L599.849,809l-7.793-3.542L584.263,809l7.793-12.93Zm0,17.9-7.276-4.3,7.276-3.307,7.275,3.307Zm0,8.713h0l-8.17-11.511,8.17,4.826h0l8.174-4.826Z" transform="translate(94.838 2651.05)" fill={props.color}/>
        </g>
      </g>
  </Svg>
  );
};

export default Icon;
